app/Models/GroupPelawatModel.php

SELECT *
FROM `group_pelawat`
---
    public function getAllGroupPelawat()
    {
        return $this->findAll();