app/Models/GroupPelawatDetailModel.php

    public function getAllDetailGroup()
    {
        $builder = $this->db->table($this->table);
        $builder->select('group_pelawat_detail.id_group, group_pelawat.nm_group, jemaat.nama');
        $builder->join('group_pelawat', 'group_pelawat.id = group_pelawat_detail.id_group');
        $builder->join('jemaat', 'jemaat.id = group_pelawat_detail.kd_pelawat');
        $query = $builder->get();
---
SELECT `group_pelawat_detail`.`id_group`, `group_pelawat`.`nm_group`, `jemaat`.`nama`
FROM `group_pelawat_detail`
JOIN `group_pelawat` ON `group_pelawat`.`id` = `group_pelawat_detail`.`id_group`
JOIN `jemaat` ON `jemaat`.`id` = `group_pelawat_detail`.`kd_pelawat`