app/Models/JemaatModel.php

SELECT *
FROM `jemaat`
---
    public function getAllJemaat()
    {
        return $this->findAll();