app/Models/JemaatModel.php

SELECT `jemaat`.*, `master_rayon`.`rayon` as `rayon`, `master_lingkungan`.`lingkungan` as `lingk`
FROM `jemaat`
INNER JOIN `master_rayon` ON `master_rayon`.`id` = `jemaat`.`rayon`
INNER JOIN `master_lingkungan` ON `master_lingkungan`.`id` = `jemaat`.`lingk`
---
    public function getAllJemaat()
    {
        // return $this->findAll();

        $result = $this->db->table('jemaat')
            ->select('jemaat.*, master_rayon.rayon as rayon, master_lingkungan.lingkungan as lingk')
            ->join('master_rayon', 'master_rayon.id = jemaat.rayon', 'inner')
            ->join('master_lingkungan', 'master_lingkungan.id = jemaat.lingk', 'inner')