app/Models/Master_Role.php

    public function getAllRole()
    {
        return $this->findAll();
---
SELECT *
FROM `master_role`