app/Models/PenjadwalanModel.php

SELECT `tr_jadwal`.*, `jemaat`.`nama` as `nama_jemaat`, `group_pelawat`.`nm_group` as `tim_pelawat`
FROM `tr_jadwal`
INNER JOIN `jemaat` ON `jemaat`.`id` = `tr_jadwal`.`nama_jemaat`
INNER JOIN `group_pelawat` ON `group_pelawat`.`id` = `tr_jadwal`.`tim_pelawat`
ORDER BY `tr_jadwal`.`createdOn` DESC
---
    public function getAllPenjadwalan()
    {
        $result = $this->db->table('tr_jadwal')
            ->select('tr_jadwal.*, jemaat.nama as nama_jemaat, group_pelawat.nm_group as tim_pelawat')
            ->join('jemaat', 'jemaat.id = tr_jadwal.nama_jemaat', 'inner')
            ->join('group_pelawat', 'group_pelawat.id = tr_jadwal.tim_pelawat', 'inner')
            ->orderBy('tr_jadwal.createdOn', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tr_jadwal`
WHERE `id` = '98'
---
    public function getJadwalById($id)
    {
        return $this->where('id', $id)
            ->get()
            ->getRowArray();