app/Models/UserModel.php

SELECT *
FROM `tr_user`
WHERE `kd_jemaat` = '1'
---
    public function getUserByKdJemaat($kdJemaat)
    {
        return $this->where('kd_jemaat', $kdJemaat)
            ->get()
            ->getRowArray();

SELECT `tr_user`.*, `jemaat`.`nama`
FROM `tr_user`
INNER JOIN `jemaat` ON `jemaat`.`id` = `tr_user`.`kd_jemaat`
WHERE `tr_user`.`role` = 'tp'
---
    public function getUserByRoleTp()
    {
        $role = 'tp';
        return $this->select('tr_user.*, jemaat.nama') // Ganti 'other_table' dengan nama tabel lain
            ->join('jemaat', 'jemaat.id = tr_user.kd_jemaat', 'inner') // Sesuaikan nama kolom dan relasi
            ->where('tr_user.role', $role)
            ->findAll();

SELECT `tr_user`.*, `jemaat`.`nama`
FROM `tr_user`
INNER JOIN `jemaat` ON `jemaat`.`id` = `tr_user`.`kd_jemaat`
WHERE `tr_user`.`role` = 'j'
---
    public function getUserByRoleJemaat()
    {
        $role = 'j';
        return $this->select('tr_user.*, jemaat.nama') // Ganti 'other_table' dengan nama tabel lain
            ->join('jemaat', 'jemaat.id = tr_user.kd_jemaat', 'inner') // Sesuaikan nama kolom dan relasi
            ->where('tr_user.role', $role)
            ->findAll();