app/Models/WilayahModel.php

SELECT *
FROM `wilayah`
WHERE `id_induk_wilayah` = '010000'
---
    public function getKotaById($idProvinsi)
    {
        return $this->where('id_induk_wilayah', $idProvinsi)->get()->getResultArray();